ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8bd9f000-83c9-4a48-8166-2691b6f02183">
  <name>ЗаказПоставщику</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="e6b39f22-3d0b-4d48-8610-f5b36bbaebc8">
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="10699bb8-b685-49df-b889-e56f9cb3a64d">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d121ce6-6d64-46b8-994d-69e60ed91a43">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="595aeccc-8e6d-4e20-a5fd-69789d5828b2">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06fbccda-70c8-41aa-84e7-f19b55ac0e9c">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79cb27a7-2b14-4398-bf17-b88ef2c2a649">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="78c21b30-8148-410f-91b7-6ee155fd8c63">
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖБИ_ДокументОснование</name>
    <comment>ЖБИ - Документ основание</comment>
    <type>
      <types>DocumentRef.ЖБИ_ЗаявкиПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_НомерСпецификации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ДатаСпецификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_УсловиеВДоговоре1</name>
    <comment>Расчеты между сторонами</comment>
    <type>
      <types>CatalogRef.ЖБИ_УсловияПоОплатеВДоговоре</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_УсловиеВДоговоре2</name>
    <comment>Срок производства</comment>
    <type>
      <types>CatalogRef.ЖБИ_УсловияПоОплатеВДоговоре</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_УсловиеВДоговоре3</name>
    <comment>Доставка</comment>
    <type>
      <types>CatalogRef.ЖБИ_УсловияПоОплатеВДоговоре</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_УсловиеВДоговоре4</name>
    <comment>Условия расчета между сторонами</comment>
    <type>
      <types>CatalogRef.ЖБИ_УсловияПоОплатеВДоговоре</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_УсловиеВДоговоре5</name>
    <comment>Дополнение</comment>
    <type>
      <types>CatalogRef.ЖБИ_Дополнение</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ПодписантПоставщик</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ПодписантПокупатель</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="dcee393b-d797-4bfd-be64-3bc288149128">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="fb7178d5-075f-4bff-bd5e-69dd3c98eeb0">
      <name>НоменклатураПоставщика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8a5b2ff1-9253-46ce-be3f-1ffa9c7e158e">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9dcfc241-72d7-4f32-8087-92a6267c3254">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЖБИ_ПередачаВОтгрузку</name>
      <type>
        <types>DocumentRef.ЖБИ_ПередачаВОтгрузку</types>
      </type>
    </attributes>
    <attributes>
      <name>ЖБИ_ЦенаПоставщика</name>
      <comment>Цена просчета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЖБИ_Сумма</name>
      <comment>Сумма просчета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="01cc7512-0c6d-46a0-aeb6-5134fe2c51c8">
    <name>ЭтапыГрафикаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЗаказПоставщику/Forms/ФормаДокумента/Module.bsl
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

&НаСервере
Процедура УстановитьУсловноеОформлениеТЧ(ИмяТаблицы,Свойство,ЗначениеСвойства,СписокКолонокИсключение,УдалитьУФИндекс = Неопределено, Очистить = Ложь)

	Если УдалитьУФИндекс <> Неопределено Тогда 
		УсловноеОформление.Элементы.Удалить(УдалитьУФИндекс);	
	КонецЕсли;
	
	Если Очистить Тогда 
		УсловноеОформление.Элементы.Очистить();	
	КонецЕсли;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Использование = Истина;
	ОформлениеУО        = ЭлементУсловногоОформления.Оформление;
	ОтборУО             = ЭлементУсловногоОформления.Отбор;
	ОформляемыеПоляУО   = ЭлементУсловногоОформления.Поля;
	Если ИмяТаблицы = "Товары"
		И Свойство = "ЦветТекста" Тогда 
		ОформлениеУО.УстановитьЗначениеПараметра(Свойство, ЗначениеСвойства);
		ЭлементОтбора                = ОтборУО.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект."+ИмяТаблицы+".Цена");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект."+ИмяТаблицы+".ЖБИ_ЦенаПоставщика");;
		ЭлементОтбора.Использование  = Истина;
		Для Каждого НомСтр Из Элементы[ИмяТаблицы].ПодчиненныеЭлементы Цикл
			ИмяКолонки = НомСтр.Имя;
			СокрИмя = Сред(ИмяКолонки,СтрДлина(ИмяТаблицы)+1,50);
			Если СписокКолонокИсключение.НайтиПоЗначению(СокрИмя)<>Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			ОформляемоеПоле      = ОформляемыеПоляУО.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяКолонки);
		КонецЦикла;
	КонецЕсли;
	
	ОформляемоеПоле.Использование = Истина;
    
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ

#Область ПриИзмененииРеквизитов

&НаКлиенте
&После("ТоварыЦенаПриИзменении")
Процедура ЖБИ_ТоварыЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;

	ТекущаяСтрока.ЖБИ_СуммаРазница = ТекущаяСтрока.Цена - ТекущаяСтрока.ЖБИ_ЦенаПоставщика;
	
	Если ТекущаяСтрока.Цена>ТекущаяСтрока.ЖБИ_ЦенаПоставщика Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Обратите внимание, цена больше закупочной!!!");		
		ЦветТекста = WebЦвета.Красный;
		УстановитьУсловноеОформлениеТЧ("Товары","ЦветТекста",ЦветТекста,Новый СписокЗначений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&После("ДоговорПриИзменении")
Процедура ЖБИ_ДоговорПриИзменении(Элемент)	
	Объект.ЖБИ_ПодписантПокупатель 	= ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Объект.Договор,"ЖБИ_ПодписантОрганизация").ЖБИ_ПодписантОрганизация;
	Объект.ЖБИ_ПодписантПоставщик 	= ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Объект.Договор,"ЖБИ_ПодписантКонтрагент").ЖБИ_ПодписантКонтрагент;	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаКлиенте
&После("ПослеЗаписи")
Процедура ЖБИ_ПослеЗаписи(ПараметрыЗаписи)
	
	Товары = Объект.Товары;
	Для Каждого НомСтр Из Товары Цикл
		НомСтр.ЖБИ_СуммаРазница = НомСтр.Цена - НомСтр.ЖБИ_ЦенаПоставщика;	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
